html/kotlin/oo/inline_class.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>内联类</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./alias.html"> UP </a>
 |
 <a accesskey="H" href="./oo.html"> HOME </a>
</div><div id="content">
<h1 class="title">内联类</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3ee59b0">成员</a></li>
<li><a href="#orgaad046f">继承</a></li>
<li><a href="#org0186cdf">表示方式</a></li>
<li><a href="#org284ebb8">名字修饰</a></li>
<li><a href="#orgd14d434">内联类与类型别名</a></li>
<li><a href="#orge508fc9">实验性状态</a></li>
</ul>
</div>
</div>
<pre class="example">
  有时候，业务逻辑需要围绕某种类型创建包装器。然而，由于额外的堆内存分配问题，它会引入运行时的性能开销

  此外，如果被包装的类型是原生类型，性能的损失是很糟糕的，因为原生类型通常在运行时就进行了大量优化，然而他们的包装器却没有得到任何特殊的处理
</pre>

<p>
为了解决这类问题，Kotlin 引入了一种被称为 <b>内联类</b> 的特殊类，它通过在类的前面定义一个 <span class="underline">inline</span> 修饰符来声明：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Password</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">value</span>: <span style="color: #98f5ff;">String</span>)
</pre>
</div>

<p>
内联类必须含有 <b>唯一</b> 的一个 <span class="underline">属性</span> 在 <span class="underline">主构造函数</span> 中 <b>初始化</b> 。在运行时，将使用这个唯一属性来表示内联类的 <span class="underline">实例</span> ： 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#19981;&#23384;&#22312; 'Password' &#31867;&#30340;&#30495;&#23454;&#23454;&#20363;&#23545;&#35937;</span>
<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#36816;&#34892;&#26102;&#65292;'securePassword' &#20165;&#20165;&#21253;&#21547; 'String'</span>
<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">securePassword</span> = <span style="color: #98f5ff;">Password</span>(<span style="color: #deb887;">"Don't try this in production"</span>)
</pre>
</div>

<pre class="example">
  这就是内联类的主要特性，它灵感来源于 “inline” 这个名称：类的数据被 “内联”到该类使用的地方

  类似于内联函数中的代码被内联到该函数调用的地方
</pre>
<div id="outline-container-org3ee59b0" class="outline-2">
<h2 id="org3ee59b0">成员</h2>
<div class="outline-text-2" id="text-org3ee59b0">
<p>
内联类支持普通类中的一些功能。特别是，内联类可以声明 <span class="underline">属性</span> 与 <span class="underline">函数</span> ： 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Name</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">s</span>: <span style="color: #98f5ff;">String</span>) {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">length</span>: <span style="color: #98f5ff;">Int</span>
        <span style="color: #00bfff; font-weight: bold;">get</span>() = s.length

    <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">greet</span>() {
        println(<span style="color: #deb887;">"Hello, </span><span style="color: #4eee94;">$s</span><span style="color: #deb887;">"</span>)
    }
}    

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">name</span> = <span style="color: #98f5ff;">Name</span>(<span style="color: #deb887;">"Kotlin"</span>)
    name.greet() <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">`greet` &#26041;&#27861;&#20250;&#20316;&#20026;&#19968;&#20010;&#38745;&#24577;&#26041;&#27861;&#34987;&#35843;&#29992;</span>
    println(name.length) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#23646;&#24615;&#30340; get &#26041;&#27861;&#20250;&#20316;&#20026;&#19968;&#20010;&#38745;&#24577;&#26041;&#27861;&#34987;&#35843;&#29992;</span>
}
</pre>
</div>


<p>
然而，内联类的成员也有一些限制：
</p>
<ul class="org-ul">
<li>内联类不能含有 <span class="underline">init 代码块</span></li>
<li>内联类不能含有 <span class="underline">幕后字段</span></li>
</ul>

<pre class="example">
    因此，内联类只能含有简单的计算属性（不能含有延迟初始化/委托属性）
</pre>
</div>
</div>
<div id="outline-container-orgaad046f" class="outline-2">
<h2 id="orgaad046f">继承</h2>
<div class="outline-text-2" id="text-orgaad046f">
<p>
内联类允许去继承 <span class="underline">接口</span> 
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">interface</span> <span style="color: #98f5ff;">Printable</span> {
    <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">prettyPrint</span>(): <span style="color: #98f5ff;">String</span>
}

<span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Name</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">s</span>: <span style="color: #98f5ff;">String</span>) : <span style="color: #98f5ff;">Printable</span> {
    <span style="color: #00bfff; font-weight: bold;">override</span> <span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">prettyPrint</span>(): <span style="color: #98f5ff;">String</span> = <span style="color: #deb887;">"Let's </span><span style="color: #4eee94;">$s</span><span style="color: #deb887;">!"</span>
}    

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">name</span> = <span style="color: #98f5ff;">Name</span>(<span style="color: #deb887;">"Kotlin"</span>)
    println(name.prettyPrint()) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20173;&#28982;&#20250;&#20316;&#20026;&#19968;&#20010;&#38745;&#24577;&#26041;&#27861;&#34987;&#35843;&#29992;</span>
}
</pre>
</div>


<pre class="example">
    禁止内联类参与到类的继承关系结构中。这就意味着内联类不能继承其他的类而且必须是 final
</pre>
</div>
</div>
<div id="outline-container-org0186cdf" class="outline-2">
<h2 id="org0186cdf">表示方式</h2>
<div class="outline-text-2" id="text-org0186cdf">
<p>
在生成的代码中，Kotlin 编译器为每个内联类保留一个 <span class="underline">包装器</span> 。内联类的实例可以在运行时表示为包装器或者基础类型
</p>
<pre class="example">
    这就类似于 Int 可以表示为原生类型 int 或者包装器 Integer

    为了生成性能最优的代码，Kotlin 编译更倾向于使用基础类型而不是包装器
</pre>

<p>
然而，有时候使用包装器是必要的。一般来说，只要将内联类用作另一种类型，它们就会被装箱：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">interface</span> <span style="color: #98f5ff;">I</span>

<span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Foo</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">i</span>: <span style="color: #98f5ff;">Int</span>) : <span style="color: #98f5ff;">I</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">asInline</span>(f: <span style="color: #98f5ff;">Foo</span>) {}
<span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #98f5ff;">T&gt;</span> asGeneric(x: <span style="color: #98f5ff;">T</span>) {}
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">asInterface</span>(i: <span style="color: #98f5ff;">I</span>) {}
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">asNullable</span>(i: <span style="color: #98f5ff;">Foo?</span>) {}

<span style="color: #00bfff; font-weight: bold;">fun</span> &lt;<span style="color: #98f5ff;">T&gt;</span> id(x: <span style="color: #98f5ff;">T</span>): <span style="color: #98f5ff;">T</span> = x

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">f</span> = <span style="color: #98f5ff;">Foo</span>(42) 

    asInline(f)    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#25286;&#31665;&#25805;&#20316;: &#29992;&#20316; Foo &#26412;&#36523;</span>
    asGeneric(f)   <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#35013;&#31665;&#25805;&#20316;: &#29992;&#20316;&#27867;&#22411;&#31867;&#22411; T</span>
    asInterface(f) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#35013;&#31665;&#25805;&#20316;: &#29992;&#20316;&#31867;&#22411; I</span>
    asNullable(f)  <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#35013;&#31665;&#25805;&#20316;: &#29992;&#20316;&#19981;&#21516;&#20110; Foo &#30340;&#21487;&#31354;&#31867;&#22411; Foo?</span>

    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#19979;&#38754;&#36825;&#37324;&#20363;&#23376;&#20013;&#65292;'f' &#39318;&#20808;&#20250;&#34987;&#35013;&#31665;&#65288;&#24403;&#23427;&#20316;&#20026;&#21442;&#25968;&#20256;&#36882;&#32473; 'id' &#20989;&#25968;&#26102;&#65289;&#28982;&#21518;&#21448;&#34987;&#25286;&#31665;&#65288;&#24403;&#23427;&#20174;'id'&#20989;&#25968;&#20013;&#34987;&#36820;&#22238;&#26102;&#65289;</span>
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#26368;&#21518;&#65292; 'c' &#20013;&#23601;&#21253;&#21547;&#20102;&#34987;&#25286;&#31665;&#21518;&#30340;&#20869;&#37096;&#34920;&#36798;(&#20063;&#23601;&#26159; '42')&#65292; &#21644; 'f' &#19968;&#26679;</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">c</span> = id(f)  
}
</pre>
</div>

<pre class="example">
    因为内联类既可以表示为基础类型有可以表示为包装器，引用相等对于内联类而言毫无意义，因此这也是被禁止的
</pre>
</div>
</div>
<div id="outline-container-org284ebb8" class="outline-2">
<h2 id="org284ebb8">名字修饰</h2>
<div class="outline-text-2" id="text-org284ebb8">
<p>
由于内联类被编译为其基础类型，因此可能会导致各种模糊的错误，例如意想不到的平台签名冲突：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">UInt</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">Int</span>)

<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#22312; JVM &#24179;&#21488;&#19978;&#34987;&#34920;&#31034;&#20026;'public final void compute(int x)'</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">compute</span>(x: <span style="color: #98f5ff;">Int</span>) { }

<span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#21516;&#29702;&#65292;&#22312; JVM &#24179;&#21488;&#19978;&#20063;&#34987;&#34920;&#31034;&#20026;'public final void compute(int x)'&#65281;</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">compute</span>(x: <span style="color: #98f5ff;">UInt</span>) { }
</pre>
</div>

<p>
为了缓解这种问题，一般会通过在函数名后面拼接一些稳定的哈希码来重命名函数
</p>

<pre class="example">
    因此，fun compute(x: UInt) 将会被表示为 public final void compute-&lt;hashcode&gt;(int x)，以此来解决冲突的问题


    请注意在 Java 中 - 是一个 无效的 符号，也就是说在 Java 中不能调用使用内联类作为形参的函数
</pre>
</div>
</div>
<div id="outline-container-orgd14d434" class="outline-2">
<h2 id="orgd14d434">内联类与类型别名</h2>
<div class="outline-text-2" id="text-orgd14d434">
<pre class="example">
    初看起来，内联类似乎与类型别名非常相似。实际上，两者似乎都引入了一种新的类型，并且都在运行时表示为基础类型
</pre>
<p>
关键的区别在于类型别名与其基础类型(以及具有相同基础类型的其他类型别名)是 <b>赋值兼容</b> 的，而内联类却不是这样。
</p>

<pre class="example">
    换句话说，内联类引入了一个真实的新类型，与类型别名正好相反，类型别名仅仅是为现有的类型取了个新的替代名称(别名)
</pre>

<div class="org-src-container">
<pre class="src src-kotlin">
<span style="color: #00bfff; font-weight: bold;">typealias</span> <span style="color: #98f5ff;">NameTypeAlias</span> = <span style="color: #98f5ff;">String</span>
<span style="color: #00bfff; font-weight: bold;">inline</span> <span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">NameInlineClass</span>(<span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">s</span>: <span style="color: #98f5ff;">String</span>)

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">acceptString</span>(s: <span style="color: #98f5ff;">String</span>) {}
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">acceptNameTypeAlias</span>(n: <span style="color: #98f5ff;">NameTypeAlias</span>) {}
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">acceptNameInlineClass</span>(p: <span style="color: #98f5ff;">NameInlineClass</span>) {}

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">nameAlias</span>: <span style="color: #98f5ff;">NameTypeAlias</span> = <span style="color: #deb887;">""</span>
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">nameInlineClass</span>: <span style="color: #98f5ff;">NameInlineClass</span> = <span style="color: #98f5ff;">NameInlineClass</span>(<span style="color: #deb887;">""</span>)
    <span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">string</span>: <span style="color: #98f5ff;">String</span> = <span style="color: #deb887;">""</span>

    acceptString(nameAlias) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27491;&#30830;: &#20256;&#36882;&#21035;&#21517;&#31867;&#22411;&#30340;&#23454;&#21442;&#26367;&#20195;&#20989;&#25968;&#20013;&#22522;&#30784;&#31867;&#22411;&#30340;&#24418;&#21442;</span>
    acceptString(nameInlineClass) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#38169;&#35823;: &#19981;&#33021;&#20256;&#36882;&#20869;&#32852;&#31867;&#30340;&#23454;&#21442;&#26367;&#20195;&#20989;&#25968;&#20013;&#22522;&#30784;&#31867;&#22411;&#30340;&#24418;&#21442;</span>

    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">And vice versa:</span>
    acceptNameTypeAlias(string) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#27491;&#30830;: &#20256;&#36882;&#22522;&#30784;&#31867;&#22411;&#30340;&#23454;&#21442;&#26367;&#20195;&#20989;&#25968;&#20013;&#21035;&#21517;&#31867;&#22411;&#30340;&#24418;&#21442;</span>
    acceptNameInlineClass(string) <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#38169;&#35823;: &#19981;&#33021;&#20256;&#36882;&#22522;&#30784;&#31867;&#22411;&#30340;&#23454;&#21442;&#26367;&#20195;&#20989;&#25968;&#20013;&#20869;&#32852;&#31867;&#31867;&#22411;&#30340;&#24418;&#21442;</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orge508fc9" class="outline-2">
<h2 id="orge508fc9">实验性状态</h2>
<div class="outline-text-2" id="text-orge508fc9">
<pre class="example">
    内联类的设计目前是实验性的，这就是说此特性是正在 快速变化的，并且不保证其兼容性

    在 Kotlin 1.3+ 中使用内联类时，将会得到一个警告，来表明此特性还是实验性的
</pre>

<p>
如需移除警告，必须通过指定编译器参数 <span class="underline">-Xinline-classes</span> 来选择使用这项实验性的特性
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="assignment.html">Next：委托</a></td>
<td class="org-left"><a href="alias.html">Previous：类型别名</a></td>
<td class="org-left"><a href="oo.html">Home：面向对象</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
